In [1]:
import mysql
import mysql.connector as connection
from mysql.connector import Error
from mysecrets import pw
import functions

import pandas as pd

Let's directly connect to our MySQL Database that contains the already processed and usable data.

In [2]:
connection = functions.create_db_connection("localhost", "root", pw, "ProcessedSportsStats")

MySQL Database connection successful

And we define this function that will let us execute any SQL query contained in a String upon the database through the MySQL connection we previously defined.

In [6]:
query = "Select * from Athletes;"
athletes_dataFrame = pd.read_sql(query, connection)

athletes_dataFrame.head()

/var/folders/q3/qxmx6rxn2xjcrqr620k0l4_c0000gn/T/ipykernel_2550/66920507.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  athletes_dataFrame = pd.read_sql(query, connection)

   AthleteId                      Name Sex  Height  Weight
0          1                 A Dijiang   M   180.0    80.0
1          2                  A Lamusi   M   170.0    60.0
2          3       Gunnar Nielsen Aaby   M     NaN     NaN
3          4      Edgar Lindenau Aabye   M     NaN     NaN
4          5  Christine Jacoba Aaftink   F   185.0    82.0

In [8]:
query = "Select * from Events;"
events_dataFrame = pd.read_sql(query, connection)

events_dataFrame.head()

/var/folders/q3/qxmx6rxn2xjcrqr620k0l4_c0000gn/T/ipykernel_2550/2611708872.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  events_dataFrame = pd.read_sql(query, connection)

,EventId,AthleteId,Age,Team,NOC,Games,Category,Medal
0,1,1,24.0,China,CHN,1992 Summer,Basketball Men's Basketball,None
1,2,2,23.0,China,CHN,2012 Summer,Judo Men's Extra-Lightweight,None
2,3,3,24.0,Denmark,DEN,1920 Summer,Football Men's Football,None
3,4,4,34.0,Denmark/Sweden,DEN,1900 Summer,Tug-Of-War Men's Tug-Of-War,Gold
4,5,5,21.0,Netherlands,NED,1988 Winter,Speed Skating Women's 500 metres,None